In [1]:
import warnings
warnings.simplefilter('ignore')

# %matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
ml_movies=pd.read_csv("Resource/IMDB_cora.csv")
ml_movies

       Unnamed: 0          country       language  world_gross_income
0              79           Russia        Russian            144968.0
1             165          Germany         German              8811.0
2             222              USA        English            772155.0
3             245              USA        English           9183673.0
4             251              USA        English             26916.0
...           ...              ...            ...                 ...
30851       85847            India      Malayalam              4791.0
30852       85850  France, Belgium         French           3507171.0
30853       85851      Netherlands  German, Dutch           7299062.0
30854       85853           Turkey        Turkish              2833.0
30855       85854            Spain        Catalan             59794.0

[30856 rows x 4 columns]